ETL/DataProcessors/ОтчетыКВыгрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>ОтчетыКВыгрузке</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>База</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Базы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОтчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

ETL/InformationRegisters/ЗаданияНаВыгрузкуОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияНаВыгрузкуОтчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НеОчищать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>БазаДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Базы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОтчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ETL/Enums/ТипыОтчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыОтчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОСВСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Карточка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ETL/DataProcessors/ОтчетыКВыгрузке/Forms/Форма/Ext/Form/Module.bsl
//******************************************************************************************
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Объект.ТипОтчета = Перечисления.ТипыОтчета.ОСВ;
	
	ВидимостьСчетов();
	
КонецПроцедуры
//******************************************************************************************
&НаСервере
Процедура ВидимостьСчетов()

	Объект.ТабличнаяЧасть.Очистить();

	Элементы.Счет.Видимость				 = НЕ (Объект.ТипОтчета = Перечисления.ТипыОтчета.ОСВ);
	Элементы.ТабличнаяЧасть.Видимость	 = (Объект.ТипОтчета = Перечисления.ТипыОтчета.ОСВ);
	
КонецПроцедуры
//******************************************************************************************
&НаКлиенте
Процедура ТипОтчетаПриИзменении(Элемент)
	
	ВидимостьСчетов();
	
КонецПроцедуры
//******************************************************************************************
&НаСервере
Функция ДобавитьНаСервере()
	
	Попытка
		
		Если Объект.ТабличнаяЧасть.Количество() > 0 Тогда 
			
			Регистр = РегистрыСведений.ЗаданияНаВыгрузкуОтчетов.СоздатьНаборЗаписей();
			
			Для Каждого Стр Из Объект.ТабличнаяЧасть Цикл 
				
				НоваяЗапись = Регистр.Добавить(); 
				
				НоваяЗапись.Счет			 = Стр.Счет; 
				НоваяЗапись.ТипОтчета		 = Объект.ТипОтчета; 
				НоваяЗапись.БазаДанных		 = Объект.База; 
				НоваяЗапись.ДатаНачала		 = Объект.Период.ДатаНачала; 
				НоваяЗапись.ДатаОкончания	 = Объект.Период.ДатаОкончания; 
				
			КонецЦикла; 
			
			Регистр.Записать();
			
		Иначе 	
			
			Регистр = РегистрыСведений.ЗаданияНаВыгрузкуОтчетов.СоздатьМенеджерЗаписи();
			
			Регистр.Счет			 = Объект.Счет; 
			Регистр.ТипОтчета		 = Объект.ТипОтчета; 
			Регистр.БазаДанных		 = Объект.База; 
			Регистр.ДатаНачала		 = Объект.Период.ДатаНачала; 
			Регистр.ДатаОкончания	 = Объект.Период.ДатаОкончания; 
			
			Регистр.Записать();
			
		КонецЕсли;
		
	Исключение
		
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции
//******************************************************************************************
&НаКлиенте
Процедура Добавить(Команда)
	
	Если ДобавитьНаСервере() Тогда 
		
		ПоказатьПредупреждение(, "Задание к выгрузке отчетов добавлено");
		
	КонецЕсли;
	
КонецПроцедуры
//******************************************************************************************
